# Read In Titanic Data
### Marshall Markham
### 2015-01-30

In [1]:
# set python search path
import sys
sys.path.append('/home/marshall')

In [2]:
# conduct notebook imports
import os

import dbconnect as db
import pandas as pd

## Set Notebook Variables
---

In [3]:
WORKINGDIR = '/home/marshall/Downloads'

## Read Files In
---

In [4]:
files = os.listdir(WORKINGDIR)
df_dct = dict()

In [5]:
for f in files:
    k = f.split('.')[0] 
    df_dct[k] = pd.read_csv(os.path.join(WORKINGDIR, f))

## Review Files
---

### File train.csv

##### Set Section Variables

In [6]:
key = 'train'

##### Review

In [7]:
df_dct[key].shape

(891, 12)

In [8]:
df_dct[key].dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
df_dct[key].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [10]:
df_dct[key].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
# get null counts
df_dct[key].isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### File genderclassmodel.csv

##### Set Section Variables

In [12]:
key = 'genderclassmodel'

##### Review

In [13]:
df_dct[key].shape

(418, 2)

In [14]:
df_dct[key].dtypes

PassengerId    int64
Survived       int64
dtype: object

In [15]:
df_dct[key].head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [16]:
df_dct[key].describe()

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.337321
std     120.810458    0.473362
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

In [17]:
# get null counts
df_dct[key].isnull().sum()

PassengerId    0
Survived       0
dtype: int64

### File gendermodel.csv

##### Set Section Variables

In [18]:
key = 'gendermodel'

##### Review

In [19]:
df_dct[key].shape

(418, 2)

In [20]:
df_dct[key].dtypes

PassengerId    int64
Survived       int64
dtype: object

In [21]:
df_dct[key].head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [22]:
df_dct[key].describe()

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.363636
std     120.810458    0.481622
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

In [23]:
# get null counts
df_dct[key].isnull().sum()

PassengerId    0
Survived       0
dtype: int64

### File test.csv

##### Set Section Variables

In [24]:
key = 'test'

##### Review

In [25]:
df_dct[key].shape

(418, 11)

In [26]:
df_dct[key].dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [27]:
df_dct[key].head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [28]:
df_dct[key].describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [29]:
# get null counts
df_dct[key].isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## Create Tables In Database kaggle

In [30]:
auth = db.PgAuth('192.168.0.7', 'kaggle')

for tname, df in df_dct.iteritems():
    schmtble = '.'.join(['titanic', tname])
    db.dataframe_to_table(df, schmtble, grant_all='analyst', ownerto='marshall', options=auth, if_exists='replace')